# all the buttons:
online_timetable_btn = "📝 Онлайн-запись 💅"
certificates_btn = "💝 Подарочные сертификаты 🎀"
price_btn = "🛍 Прайс 💸"
offers_sending_btn = "💌 Рассылка спец. предложений 🎁"
all_the_text_editor_btn = "Изменение текста"
default_text_modes_menu_btn = 'Темы по-умолчанию'
get_texts_list_btn = "Редактировать текст"
check_appointments_btn = "📆 Мои записи ☕️"
settings_btn = "🛠 Настройки ⚙️"
back_to_menu_btn = "⏪🏠"
make_appointment_btn = "☎️ Записаться 📝"
appointment_info_btn = "⏰ Моя запись 📅"
cancel_appointment_btn = "💔 Отменить 💔"
timetable_range_btn = "Диапазон"
three_month_range_btn = "3 месяца вперёд"
one_month_range_btn = "Месяц вперёд"
year_range_btn = "Год вперёд"
week_range_btn = "Неделю вперёд"
working_hours_btn = "Часы работы"
weekends_btn = "Выходные дни"
holidays_btn = "Отпуск"
dates_between_range_btn = "Частота записи"
holidays_menu_info_btn = "Ближ. отпуск"
holidays_menu_cancel_btn = "Отменить отпуск"
holidays_menu_set_btn = "Запланировать отпуск"
back_btn = "⬅️"
close_btn = "❌"
finish_btn = "✅"
pass_btn = "✖ Заглушка ✖"
agreement_btn = "Да, конечно"
disagreement_btn = "Нет, не нужно"
off_bot_btn = '✖ Отключить ✖'
on_bot_btn = '✅ Включить ✅'


# ---- nav/comeback messages:
main_menu_nav_msg = "Вы находитесь в главном меню."
main_menu_comeback_msg = "Вы вернулись в главное меню."
timetable_menu_nav_msg__admin = "Открыто меню администратора онлайн-записей."
timetable_menu_nav_msg__user = "Вы находитесь в пользовательском меню онлайн-записи."
shop_nav_msg__admin = "Добро пожаловать в редактор витрины Вашего магазина!\n\n Выберите один из вариантов ниже."
shop_nav_msg__user = "Добро пожаловать в наш магазин сертификатов!\n\n Наши товары:"
timetable_editor_nav_msg = "Вы перешли в раздел редактирования режима онлайн-записи."
timetable_editor_comeback_msg = "Вы вернулись в раздел редактирования режима онлайн-записи."
timetable_comeback_msg = "Вы вернулись в меню онлайн-записей."
holidays_menu_nav_msg = "Вы находитесь в меню управления отпуском."

# ---- exception messages:
main_menu_comeback_exc_msg = "Пока невозможно вернуться во время записи."
make_appointment_exc_msg = 'В данный момент онлайн-запись через бота недоступна.'
without_appointment_exc_msg__info = "У вас нет текущей записи на данный момент."
without_appointment_exc_msg__cancel = "Вы и так не записаны."
working_hours_choosing_exc_msg = "Часы работы выбранны некорректно, попробуйте ещё раз.."
without_holidays_exc_msg__info = "На данный момент нет запланированного отпуска."
without_holidays_exc_msg__cancel = "У вас и так не запланирован отпуск."
with_holidays_exc_msg__setting = "У вас уже есть запланированные каникулы, отмените их, чтобы запланировать новые."
dates_between_exc_msg = "Введён некорректный временной диапазон между записями.\n" \
                        "Необходимо ввести целое положительное число"
all_the_exc_msg = "Ошибка, выберите предложенный вариант."
online_timetable_is_off_exc_msg = "В данный момент онлайн-запись отключена. Если вы были записаны до этого," \
                                  "и вашу запись не отменил администратор, то ваш приём состоится," \
                                  "вы также можете отменить запись, если хотите."

# ---- tips-messages:
timetable_range_tip_msg = "Установите возможный диапазон для записи."
time_choosing_tip_msg = "Выберите время начала работы:"
working_hours_choosing_tip_msg1 = "Выберите время начала работы:"
price_checklist_msg = "Выберите услугу для получения подробной информации.."
all_the_text_editor_menu_msg = "Вы находитесь в текстовом редакторе бота. Тут можно изменить текст отправляемых сообщений, или кнопок."
dates_between_range_tip_msg = "Введите промежуток между записями в минутах\n" \
                              "(время через которое будут расположены свободные записи)"
bot_has_been_off_msg = "Онлайн-запись была отключена вами."
bot_has_been_on_msg = "Онлайн-запись вновь работает."

# ---- notification-messages:
promise_msg = "Мы обязательно напомним вам о приёме за день и за 2 часа до вашей записи."
day_before_notify_msg = "Добрый вечер! напоминаем, что завтра вы записаны на приём! Напомним вам ещё раз об этом за 2 часа до приёма"
two_hours_before_notify_msg = "Через 2 часа у вас состоится приём."


# the other messages:
welcome_msg = "Привет! 👋\n"
pass_message = "Сюда функционал ещё не завезли"
conv_handler_stop_msg = "Остановлено."
authorized_already_msg = "Вы уже авторизованы.\n"
working_hours_choosing_msg2 = "Теперь введите время прекращения работы"
dates_between_range_has_been_set_msg = "Промежуток между записями успешно установлен!"
