# мб здесь будут все разновидности клавиатур, так как
# бот должен управляться в основном с клавы, предлогаю сделать
# меню из клавиатуры, в котором будет весь функционал (на ютубе есть инфа по реализации ес чо)
# , и все разделы будут управляться в основном с клавиатуры типо

# main menu
MAIN_MENU_KEYBOARD__user = [["онлайн-запись"], ["товары"], ["вопрос-ответ"]]

MAIN_MENU_KEYBOARD__admin = [["онлайн-запись"],  # для админов онлайн-запись будет расписанием заказов в будующем
                             ["доходы"],
                             ["список конкурентов"]]

# online-appointments
MONTH_CHOOSING_KEYBOARD = [["(текущий месяц)"], ["январь"], ["февраль"], ["март"], ["апрель"],
                         ["май"], ["июнь"], ["июль"], ["август"],
                         ["сентябрь"], ["октябрь"], ["ноябрь"], ["декабрь"], ["_назад_"]]
ONLINE_APPOINTMENTS_KEYBOARD__admin = []
