# main menu
MAIN_MENU_KEYBOARD__user = [["Онлайн-запись"], ["Сертификаты"]]

MAIN_MENU_KEYBOARD__admin = [["Онлайн-запись"],
                             ["Сертификаты"],
                             ["Рассылка спец. предложений"]]

INVOICE_EDITOR_KEYBOARD = [["Добавление позиции", "Изменение позиции", "Удаление позиции"],
                           ["Просмотр позиций", "<< Назад в меню"]]

# online-appointments
MONTH_CHOOSING_KEYBOARD = [["(текущий месяц)"], ["январь"], ["февраль"], ["март"], ["апрель"],
                           ["май"], ["июнь"], ["июль"], ["август"],
                           ["сентябрь"], ["октябрь"], ["ноябрь"], ["декабрь"], ["<< Назад в меню"]]

ONLINE_TIMETABLE_admin_menu = [["Текущие записи"], ["Настройки"], ["<< Назад в меню"]]

ONLINE_TIMETABLE_user_menu = [["Записаться"], ["Инфо моей записи", "Отменить запись"], ["<< Назад в меню"]]

ONLINE_TIMETABLE_SETTINGS = [["Диапазон", "Часы работы", "Выходные", "Отпуск"],
                             ["<< Назад"]]

TIMETABLE_DURATION = [["3 месяца вперёд"], ["Месяц вперёд"], ["Год вперёд"], ["<< Назад"]]


# Служебные клавы
PASS_KEYBOARD = [["Заглушка", "Заглушка"], ["<< Назад в меню"]]
CANCEL_KEYBOARD = [["<< Назад в меню"]]
